{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "Conv2D", "config": {"name": "custom_conv2d_name", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 128, 128, 3]}}], "build_input_shape": [null, 128, 128, 3]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "custom_conv2d_name/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "custom_conv2d_name/bias", "shape": [64], "dtype": "float32"}]}]}